app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
UPDATE "posts" SET "author" = ?, "ptype" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["author", "Emily"], ["ptype", "Freedom"], ["updated_at", "2021-11-09 11:22:19.930021"], ["id", 8]]
---
  def update
    @post=Post.find(
    params[:id]
    )
    if @post.update(check_params)

INSERT INTO "posts" ("author", "ptype", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["author", "Emily2"], ["ptype", "Freedom2"], ["created_at", "2021-11-13 10:27:07.124124"], ["updated_at", "2021-11-13 10:27:07.124124"]]
---
  def create
    # byebug
    @post= Post.new(check_params)
    if @post.save